# ViewDepth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewDepth Property
ParameterTypeId Class See Also
---
"View Depth"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewDepth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewDepth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewDepth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace